Polls/polls_app/app/models/response.rb

    def sibling_response
        return self.question.responses.where.not(id: self.id)
---
SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 411], ["LIMIT", 1]]